#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "621b8a22ec9502bb4308aa8ec187704d" -> "c1011522e85bfce309028fd8c58bba94"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5424093d114a1a5d256aaa1aa1c48221" -> "b1f7d3928d72020af03ee3c7911edce9"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "d37aa28fe10affd6597048d430422763" -> "063eb9a7aca918a6f93b8f8eb53cdd77"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "95b1e1b805a9c699b72a3f96c1657769" -> "c85ed9b2ea9bb807bedf0f88706c37a2"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "52ea4ad2bdb38ac270f2b9db27be43f3" -> "8b9ece9716e85373531393c2503dc836"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "52a4ae73d7056dc89ba46ffd723eba0c" -> "c7049e9d682e055579dc920c9aae16ab"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f60874f6fbc7fd96efdd174d3f58d8b8" -> "c03743a20e9970bd32388a513103c0ef"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "2696d37ef32054ea5dca9cf2839603ae" -> "6e0150a4291407b16c284f7910ecac53"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f64866a7b0c8f36b07cd710b6e3ebd32" -> "90b11552ec7547be7e58436c82b64791"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "19d33956a961cf121d92755cc1123df9" -> "d44f7bbf8c070847a7242b3705089060"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c1eb43fac0e4d5c11835e7995bdc3328" -> "99ad28217bdb3752c148b99039a6b326"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b4aa1bdc1adb4e38cfe1f8e3e7976cad" -> "e69449e2fc0a0179db47b7fbb64a6a9b"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "cdb566769a31d6a0e0fc54ee9a223245" -> "dac93df9d985d6bbe903f5c78c6207c6"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3182ffc9db3cb7f7879fca101d13f0b7" -> "55836a9e8b19bf1425883aeb53b28744"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "b1a71d40862a9aa73be8e44bf8053702" -> "09b1f2e533177369aeec892ced609213"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "1b901c5086720d3cda501ff3adda2787" -> "95355973cd0e9d9481b463cfdc295588"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a115b7d0744cb59e243d4fb76ea0d2ec" -> "465731d2f52962efeea6188f4225031e"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "0e63ad05f17c3fea424be61a0b65c102" -> "2288dc3ec7be6f712071291bc4edd023"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "dbb8b31252926908707ba281e89946af" -> "e9f3359ba48eee5c14b150ab94ca8eb1"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "44918046a528cf76bfd230b91c8571e2" -> "e41c7c3d6c76a30ddb4e67927dab83eb"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c2d7a0105e4edbc3397f1200ccd84160" -> "1342d51b8b19c18ea39eae07f3f58d24"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "93930cd5d6ca05832af6b512a1245100" -> "2548ed763ad3d48b3cec5abb2cca5d85"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e8ab3d2a8a7da8e551e02d2639547fe3" -> "ce1f16bd07e29404548ee2df45a1b225"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c2c293382343b9396d79c31cb9808b75" -> "a58dc7238350e3c449e480b137663a40"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "b705fd85cf6129aa5cf0b3a32cd4eb12" -> "ae924ebd9aa2e8b3b9eca3c00349a437"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "5b91121117d40e14f8d4638f6e9eb349" -> "96444c7f506f5699ad8b783e35e58864"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e38c7b45e6a6f4820b8c96ce3a3bc337" -> "ce71899b8dde41d3b4f990e3939fd211"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "29243f5f5843e7091cee4ec4abe371b2" -> "79ca4596aa894f9c49dc3e543410ceaf"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "ecd8b269323e1254e1f63a66a751b0c1" -> "a2270f3f00fa7eabb2f22a097f06637d"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "0b78c3de9821132b61332dadda7684c2" -> "80b6b99a5914370ce26d7fef3368f127"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f2adf0fe95a27f563b2d8a184b4bb783" -> "d5a746e0b90d6f742a386e013115255f"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "41d203f4cf57735aecd25dbce21b4a54" -> "ad6de1fb7e1d3c5a16d9e9c88b5acdfd"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "4565ac8989d532d0caeb93af3bc65f98" -> "85d59eb91de8840d4b8793eb10941471"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "dd508c6953c3e341c43d365a680947f7" -> "1963bbbde3b60db898788cd0cc7344f3"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1ec55e77898b97bab33678f4eba44b3b" -> "c6f8ae12269cf1667173ffa2a5e23c74"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "c1b037a09f95d7949a3bb715d99563d0" -> "a66928e511ad4089d7380f3df5739348"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02f8b9a079a2a071270c8423b3dea05a" -> "6a06c9a1630f0f042b171588f544b632"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "516996bcd57de1bad7cf6726f2734256" -> "09435fe2247422b364c6f2f81705d991"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e7a6869d52619df0360ab52e2c265c5a" -> "211347399a05fd7aa3d77aefc3085fcd"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "da34dfa8d313cea45c25e27c368ce6e7" -> "9854577fcf31b59ea223a018f9353e71"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "b9f1aeb6e8a7524befa4ca2bc5c01963" -> "fbbf4ff64e616d2243186e2f6fc7994c"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "51098d30771485c8ac65ee9710199fc6" -> "f0e9932833dcd651dd59d5a9aa2e1237"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "36e1b8285241d52c30b537d6ecfbf969" -> "04723f178e638c7daf78678ec6ff2a85"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "GpxlRW6erNNgGyVi7nHngR54P61qX3oNrOtoZ5L0nAk=" -> "E43GoYE8Fy0a9M7I5DCCJEmh3fXNE3UWSKK8KEmIW+Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ACaQ2iA/Uf9O8umY1avcleE/j/emfJcTMDNx5VWJT2I=" -> "+ITwAa0M02J/G+IGGzIHbKJ3pUjsTD/7dY2JiWs5BgU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kM/yBDSuzXCA4kxMRxXQUBOS4X009ZvtgwuTmpBG6xg=" -> "obNp1wBDFS7e9PKTzWZkLFH17X4rPWdLkTDJP9pIEzY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "U7ZwrPsi1rDAzHH/5O4hGKHqKKXH9+iDO5B9KknOYTk=" -> "IpG6dhGlIFAXzvw2vE1Fr4/Zaix1HeU21qKWRwEetHk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CTF/G0OKeMFi6U+8WfpQh+jRG+ciJf15ETWeOk+i7XA=" -> "voq1ObLcnojlitWqH9l/Z1SkLqownDFnWk9ZWkmgfQQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuTKy9xT3dHmtW8ZF+u0eceVZla/ioMqowgajaBOZYc=" -> "ZekF3w+XPcmmGqu/m4XXCW2c4pJGglqduo7kvn0uW2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKw6FT/s+ne8gXKu52AtntKlN9szJaZpZq3Tu6teU7U=" -> "7QCNe4RRIYuuz1ch0gxdM9sPUOK4r2uguRq2dggyrdI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "IaeTVM6O62ehj3qpc8L/9TSibB7sAXRkkgngq0nH4BU=" -> "VBsSPoWorwpSfNi9zTBFJV+BecsxvmbCpIBk8pXbok8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aYXUc4ckpLYEsSZ5iWsdx3F7hXYUEntUYmw15po2fw8=" -> "Ir1nztjLcSHw07GsrMJU9IWrocqBs8Hx2DrxXTI3cTQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "Oa/fr3Nqq6+j+F8ePTbZZygqnQ10xTRN11u7+oh8vbw=" -> "sNBAKWLy4LFvuAzxGsZMKsqoE6idDyoJLg1t0bhJTNU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Irl/CJoO/LlAXowQ/E41y8RPjTthuAD6RWYynIWGi0U=" -> "GBMagdA0r239ok4j8csNMmfyVOPvE0BRwKLpKslm/s8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "fCj2EXa0Y2ZeUAm51ZOOmyF9Gue9DOsv6VLdrblfv5I=" -> "wIcBtdGKSvvgqjeHWhk5Rnq4muDimBjE/V96VlCoJcw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "MCCkz5HPRlTsspYOkEVrrXtH4iSbNvhkLkUDMkB4Uh4=" -> "EnObjT6HkcNivbVjKkOh9cGsMVj8NsKm1qDnss033ic="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFLWVgTV6MV5YuJHMx7wndJ4nfplNKvXWB4Txeqwr8g=" -> "E4NOEWAunsdzlPe3+m4xMMRP3dQ5i9SmOtGKDOMElzQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "60SCU1tadnttLvhqxwWfj36SeXRmVVlVGHjvrWgEVFU=" -> "MBsVujOx5AkO7Il5/RAzTq/IoIOUD8IcO0z9C+eTTME="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "6A2A4xUnKzS4vq7bdnlcenIjr/v+/X/1ypyeZUkdOTA=" -> "4BvriD8exQlY5/CzvZ2Sk61K2jutONToDfZhtoHuxvU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "CZCIVTWH6TU8VbMld8PT2K9tjUT68ddSrs93RIYq7c4=" -> "/t1LrvqwEUxUYUzee+2ATmDtUgdgNztn+k3SNBsBpWM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "xqQvAZCNGviCNhhWQs+Ddt38xBftIGZNA7OQ9z7Spu0=" -> "tXwCDnvplXF1qYDJL9FJzS99Zsis/tbeTpK7vLUjPFc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "GwwEWm8Ax8qmSILT+YrlgoOWjLp9s66R847uc32X2wE=" -> "dnpiqlOJE0/VNJT/NlPiInSH3xc+21URVxSYhAs+6u8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "1AmHcMetcH9+3772BRRUgNSetfqmUH8LuqPY0iZOPl4=" -> "3yRN1JNtcEt8HrTuw7j57rHfUvUS7RkWwGSbRJK5gq8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "znyrl9PGbiJ5nAJN6bd2OqbhaOCd7EZl86NNjDEKmRU=" -> "n53mBntQOGBbw2xLs+EOYM6WcY/kgdhOcWY7fcuZKOM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "V5GVH+qta6CXJFbaTAJp0v6aLPGeGtfNlIjMeRAEnMU=" -> "AWLAXtYxcIsH5D9lsSSOeJlo3gZjy3FE1N+eLmrRacw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q1+Nv5Wre9wCCPPQxjrNX3qFtOX6yM7EizCGfqRnAI0=" -> "M3zNhBZdU0NG/1ET4//CixNAF7EsDEBgs0CzlcfYxBc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "vd0Jd0w1AVhuW7TFBYGs0m1Ws7tq3Q38uuaLFqK17js=" -> "vGvxMmwefJuoToJAv27HIXe3IH2eI/5X6UKT2JWukk8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zj0cKzxRnr/DFc+npcDwx6UpMXq9PpdlUgAngWLk/0k=" -> "sfw3sHsWIlOuoJJW/7UwBO8jn1FmSghViQqE47wqDTc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/Y3dOPVPatsRc0OdRBCoLAmHw3ZdXVNtQDRMhxNPVI=" -> "vvTNV7Td9Na/9iMIaryAVSXuo3Lod5zs3tSGiHoSf2A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "GLi186NY01em5Y/mAYTNV4mcrFNMCbZJ1qOt/2+gPQg=" -> "4rSiSOzj71jlICR94Rywc9KWnKN6lGOdCRda6kZpVeY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "GbZ2EcJ7HmGxddiSvRHLSSisyf67066kyLC+aifDrD0=" -> "MCie3wL1oAue9G+aO0GLlSraUb3GBPcQlcCaLyOS4xc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "iRVuFcYztVf3ijIh/8+RS0W+2cnmVd/I8ulm2jPMxyU=" -> "jV6WqUBLllhHAGl2Q8hJCVEP5egWYsREfPh/0AfxcPo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "o45RpGVmhxjSgFRJou2gS6L+ipIvDlB1ANUvsOrPI7s=" -> "R0vBgTVzPCf/h/ekh5qcZDC6YHberS7wdQvTcKFpbbE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKsQQRPpj2yPogI8vThZ6SqXuWAvGYdRGlGWv2xnRr8=" -> "U9mTtPEyuGBvSYs3D997wb9Uo5hdlC+Iu4eD/HlB7Vk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "/s+gA83DnAgzhpVlu4LkeGnPlLGGH3skxQHB5lM2/Bo=" -> "rhQtj3xB3Nwb+rvc8r54LylCgc5YfgWnOcjHiLsVttE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCmtwKuv5CnUAm+fr6GLcJMLjsgOSlEIxT8xobMNAUw=" -> "zzLOD65N/1nAdCu3DSceL2NUu2D8zpjwByPVSTOhY1Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "TSj12fp06ujnAgMB8VODrORirMe4Y/3Rvd6Bl2JWHRA=" -> "ATPBXWjet32LKn2UQg7x2F6xM7zk81vCopcnjOMuux0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "6qPuauwQy7mEuk7rxNKGm5eQW1ysR0Gm426WhKOz39A=" -> "57ftwpQsDczC57QofbJf4Jxir1LmTrKfOScxe20eUfQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "jXL27f678LVKTCY/FkyGKjUjBayAK1S6bl+IKnuTNDg=" -> "HCsdj7LzSD1nMxoPGbQKIM7uhU3Qhzn8UR/ctD8o+Pk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YA2Ldttnk21v6NaYOaRVmi1cFZDL4lbF53v/XBLU9so=" -> "THzpv4a6pQDunDJX0LCGxyQKA98gxViJOEDH5d4SSxg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "i6Y284eIOjf/kakPuxvPpL1nwqrry5qYnmapd1n5bBE=" -> "MqZysclUSEzSttJdKzT6+no6NjBklQ9jFwk3Q+YBcHw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "5LtDCYQPOLxqt8NWFiwNgST/pn/QTkvP2Tq05JgjDbw=" -> "G650t2SMN4LRRGo0ZCbkmbA8szKcXpYwQl+PSXoh4XY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "6SN/Ks2wG39i4GWwAyvbWiKBUnGtQqPJLE+CPOxK35k=" -> "WgxBA+hvXpnVVh8O3eWQLWoM7MsZtvaOxyszK4iXWAw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "6xHUmuMOMZhQdH0w7uuc8X2cm8YJx3VWDT9J2rWIo7g=" -> "yfpdor3ImMCotcAUagm8gZAnT/+HYH7E+xo5Fd/S2EQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4wCcTXyQzRDBLrwWFntfCy6ZYDplzV8bmGkLsuVLgaI=" -> "d3aRGgmD3Kv5A8TH6xD0PrlUy7wsm5HckZP6KLnBb0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T19:02:51Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "99awu9" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T19:02:51Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T19:02:50Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*